25-rails-auth-cont/flatiron-club/app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks" WHERE "drinks"."user_id" = ?  [["user_id", 2]]
---
  def index
    if logged_in?
      @user = current_user
      @drinks = @user.drinks
    else
      @drinks = Drink.all