21-rails-validations/halloween/app/controllers/victims_controller.rb

SELECT "monsters".* FROM "monsters"
---
  def new
    @victim = Victim.new
    @monsters = Monster.all

INSERT INTO "victims" ("name", "speed", "living", "monster_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Mary"], ["speed", 2345.0], ["living", 1], ["monster_id", 12], ["created_at", "2019-10-16 15:52:06.103539"], ["updated_at", "2019-10-16 15:52:06.103539"]]
---
  def create
    @victim = Victim.new(victim_params)

    if @victim.save